weighin_rails/app/controllers/highlight_controller.rb

INSERT INTO "highlights" ("user", "url", "start", "end", "element_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user", "someone"], ["url", "something.com"], ["start", 1], ["end", 2], ["element_id", "1"], ["created_at", "2017-06-18 15:26:10.696861"], ["updated_at", "2017-06-18 15:26:10.696861"]]
---
  def update
    message_json = params[:highlight]
    user = message_json[:user]
    location_start = message_json[:start]
    location_end = message_json[:end]
    url = message_json[:url]
    element_id = message_json[:element_id]


    message = Highlight.new(user: user, start: location_start, end: location_end, url: url, element_id: element_id)
    puts message
    message.save!

SELECT  "highlights".* FROM "highlights" WHERE "highlights"."url" = ? LIMIT ?  [["url", "something.com"], ["LIMIT", 1]]
---
  def show
    highlights = Highlight.where(url: params[:url])